app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @contact = Contact.find(params[:id])